---
title: AutoJoinFailures
classe: Autodesk.Revit.DB.BuiltInFailures+AutoJoinFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# AutoJoinFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId DesignOptionAndWorksetViolation { get; }` | `AutoJoinFailures.DesignOptionAndWorksetViolation` | FailureDefinitionId |
| `FailureDefinitionId DesignOptionCannotReference { get; }` | `AutoJoinFailures.DesignOptionCannotReference` | FailureDefinitionId |
| `FailureDefinitionId OtherNonEditJoinFailure { get; }` | `AutoJoinFailures.OtherNonEditJoinFailure` | FailureDefinitionId |
| `FailureDefinitionId UnexpectedJoinFailure { get; }` | `AutoJoinFailures.UnexpectedJoinFailure` | FailureDefinitionId |
| `FailureDefinitionId Unknown { get; }` | `AutoJoinFailures.Unknown` | FailureDefinitionId |
| `FailureDefinitionId WorksetJoinWarn { get; }` | `AutoJoinFailures.WorksetJoinWarn` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```